Chapter14/PnbBpelModule/src/pnbWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="pnbWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/pnbWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://j2ee.netbeans.org/wsdl/pnbWSDL" xmlns:plink="http://schemas.xmlsoap.org/ws/2004/03/partner-link/" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="getOrderPriceRequest">
        <part name="OrderId" type="xsd:int"/>
    </message>
    <message name="getOrderPriceReply">
        <part name="Price" type="xsd:int"/>
    </message>
    <portType name="pnbWSDLPortType">
        <operation name="getOrderPrice">
            <input name="input1" message="tns:getOrderPriceRequest"/>
            <output name="output1" message="tns:getOrderPriceReply"/>
        </operation>
    </portType>
    <binding name="pnbWSDLBinding" type="tns:pnbWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="getOrderPrice">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/pnbWSDL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/pnbWSDL"/>
            </output>
        </operation>
    </binding>
    <service name="pnbWSDLService">
        <port name="pnbWSDLPort" binding="tns:pnbWSDLBinding">
            <soap:address location="http://localhost:18181/pnbWSDLService/pnbWSDLPort"/>
        </port>
    </service>
    <plink:partnerLinkType name="pnbWSDLPartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plink:role name="pnbWSDLPortTypeRole" portType="tns:pnbWSDLPortType"/>
    </plink:partnerLinkType>
    <plnk:partnerLinkType name="pnbWSDLPartner">
        <plnk:role name="pnbWSDLPortTypeRole" portType="tns:pnbWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
