Chapter14/OrderPricing/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pnb="http://j2ee.netbeans.org/wsdl/pnbWSDL">
  <soapenv:Body>
    <pnb:getOrderPrice>
      <OrderId>1000</OrderId>
    </pnb:getOrderPrice>
  </soapenv:Body>
</soapenv:Envelope>